app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
    def set_all_ingredients
      @ingredients = Ingredient.all