app/controllers/mealdays_controller.rb

SELECT  "mealdays".* FROM "mealdays" WHERE "mealdays"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def find_mealday_in_params
      @mealday = Mealday.find_by(id: params[:id])

SELECT "mealdays".* FROM "mealdays"
---
    def set_all_mealdays
      @mealdays = Mealday.all