app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    params[:recipe][:ingredients_attributes].each do |i|
      @recipe.ingredients.build(quantity: i.quantity, unit: i.unit, description: i.description)
    end
    byebug;
    if @recipe.save
---
SELECT "recipes".* FROM "recipes"
INSERT INTO "ingredients" ("recipe_id", "quantity", "unit", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 14], ["quantity", 1], ["unit", "unit1"], ["description", "desc1"]]
INSERT INTO "recipes" ("name", "directions", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Happy Food"], ["directions", "Eat until sad tears turn happy"], ["created_at", "2019-01-26 06:02:53.630659"], ["updated_at", "2019-01-26 06:02:53.630659"]]

    def find_recipe_in_params
      @recipe = Recipe.find_by(id: params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_all_recipes
      @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"